In [8]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

In [9]:
df = pd.read_excel('Book2.xlsx')
df.head()

         CustomerName    PhoneNo BusinessDate
0       JAPHET LUKARI  100271812   2023-12-02
1          Gopinath .  100304056   2023-10-05
2  ANASTACIA NYAMBURA  100307002   2023-07-03
3       MARY NYAMBURA  100345700   2023-08-30
4        CARL GITONGA  100360865   2023-12-14

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83763 entries, 0 to 83762
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerName  83762 non-null  object
 1   PhoneNo       83763 non-null  int64
 2   BusinessDate  83763 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 1.9+ MB

In [11]:
df['BusinessDate'] = pd.to_datetime(df['BusinessDate'])

current_date = datetime.now()
six_months_ago = current_date - timedelta(days=180)

filtered_df = df[df['BusinessDate'] >= six_months_ago]
print(filtered_df)

             CustomerName    PhoneNo BusinessDate
0           JAPHET LUKARI  100271812   2023-12-02
1              Gopinath .  100304056   2023-10-05
2      ANASTACIA NYAMBURA  100307002   2023-07-03
3           MARY NYAMBURA  100345700   2023-08-30
4            CARL GITONGA  100360865   2023-12-14
...                   ...        ...          ...
83758       AHMED MUHAMED  799996779   2023-08-12
83759       RUBIS KITENGE  799998005   2023-07-28
83760     MOHAMED MOHAMED  799998474   2023-08-15
83761             YUSUF Y  799999969   2023-09-13
83762         NAILA AHMED  799999994   2023-11-30

[83763 rows x 3 columns]

In [12]:
filtered_df.to_csv('Book2.csv')